[
  {
    "type": "paragraph",
    "children": [
      {
        "text": "Date: 20200117\nDocket: IMM-3128-19 \nCitation: 2020 FC 70 Toronto, Ontario, January 17, 2020\nPRESENT: Mr. Justice Diner\nBETWEEN: "
      },
      {
        "text": "SUKHPREET SINGH BRAR",
        "accepted_83aefe04-b326-4d44-90cd-ed01e775bbc7": true
      },
      {
        "text": " Applicant and THE MINISTER OF CITIZENSHIP AND IMMIGRATION Respondent"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "JUDGMENT AND REASONS\n[1] Mr. "
      },
      {
        "text": "Brar",
        "accepted_42fffc57-9b3f-4590-bb3f-47ac83165070": true
      },
      {
        "text": ", a citizen of India, earned a "
      },
      {
        "text": "welding",
        "accepted_9eb95fc8-1063-49a9-a6c3-3d94ed856383": true
      },
      {
        "text": " diploma in 2013, and has worked in that trade since. In early "
      },
      {
        "text": "February",
        "accepted_1f5eff85-9952-45b8-abc8-25c9354e7acf": true
      },
      {
        "text": " 2019, a company offered Mr. "
      },
      {
        "text": "Brar",
        "accepted_a81c2abc-4138-4a0d-a849-1b76cbcc369e": true
      },
      {
        "text": " a permanent, full-time position as a "
      },
      {
        "text": "welder",
        "accepted_677a2131-4c39-479e-98f9-05b0a5ddbcc0": true
      },
      {
        "text": ", and he submitted a work permit application shortly thereafter. In "
      },
      {
        "text": "May",
        "accepted_3e18593c-b988-4e49-acce-c82ffb9e820c": true
      },
      {
        "text": " 2019, a visa officer [Officer] conducted an interview with Mr. "
      },
      {
        "text": "Brar",
        "accepted_9647ee67-35ad-4670-b036-cd232ee6895b": true
      },
      {
        "text": ", and refused the application [Decision]. Mr. "
      },
      {
        "text": "Brar",
        "accepted_a4fe2b44-ecdb-4038-8919-83b5ad815ec0": true
      },
      {
        "text": " now challenges the Decision. For the following reasons, I find that it is reasonable."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "I. Background\n[2] Mr. "
      },
      {
        "text": "Brar",
        "accepted_39915ecb-3e96-4272-b305-d3725700c7ad": true
      },
      {
        "text": " attended the interview with an interpreter. When asked what language he wanted to conduct the interview in, Mr. "
      },
      {
        "text": "Brar",
        "accepted_c52a3524-9f7b-43f3-8326-1e34a860498f": true
      },
      {
        "text": " requested Punjabi. The Officer queried whether English was a job requirement, at which point Mr. "
      },
      {
        "text": "Brar",
        "accepted_8f609688-e58b-4a19-a8a8-9011857dae8a": true
      },
      {
        "text": " indicated he wanted to conduct the interview in English. The interview proceeded in English. The Officer’s Global Case Management System [GCMS] notes detail the interview questions and responses, and provide the reasons for the Officer’s Decision. Some problematic examples from the GCMS notes include that when asked about: what kind of visa he had previously applied for, Mr. "
      },
      {
        "text": "Brar",
        "accepted_b44662f0-1db1-4688-8ce9-88eedfd7158e": true
      },
      {
        "text": " responded that he had experience. his education, he said that he had completed a one-year diploma in "
      },
      {
        "text": "welding",
        "accepted_af64af98-c769-4a43-8651-4444649b8a21": true
      },
      {
        "text": ", but later in the interview, Mr. "
      },
      {
        "text": "Brar",
        "accepted_312414fa-14e4-458a-a95b-63026df20da0": true
      },
      {
        "text": " could not answer a question about the duration of his "
      },
      {
        "text": "welding",
        "accepted_6aba0799-4489-4f11-a69b-3a99b13d18ec": true
      },
      {
        "text": " program. what he did before completing the "
      },
      {
        "text": "welding",
        "accepted_000eb962-889b-4b95-8448-fc31164f8fb2": true
      },
      {
        "text": " diploma, Mr. "
      },
      {
        "text": "Brar",
        "accepted_ac84b9c0-0c46-40f6-b4e1-18ce360fbf7f": true
      },
      {
        "text": " said that he is working and has experience. what kind of work he was doing presently, after the question was repeated, Mr. "
      },
      {
        "text": "Brar",
        "accepted_3b09f208-6756-48bc-b3dd-8282fb436f4d": true
      },
      {
        "text": " said that he was a "
      },
      {
        "text": "welder",
        "accepted_2fa64266-fd9d-4c7f-91f0-b229090a13c1": true
      },
      {
        "text": ", and noted that “there are many "
      },
      {
        "text": "instruments",
        "accepted_408b75e6-a776-4655-85f3-d8ab9dd38639": true
      },
      {
        "text": " …” what he would do to learn the job duties, Mr. "
      },
      {
        "text": "Brar",
        "accepted_ca920560-87f8-4831-b20d-2e87cec44f32": true
      },
      {
        "text": " stated that his cousin is working there and that “this is a good job.” · why he brought a letter from his prospective employer to the interview that he did not include in his initial application, Mr. "
      },
      {
        "text": "Brar",
        "accepted_b7a3feec-18d5-47d6-8499-0fc7a7698ec9": true
      },
      {
        "text": " did not respond despite being asked three times."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[3] The Officer also noted a concern with Mr. "
      },
      {
        "text": "Brar",
        "accepted_1e3674f2-9858-46f9-8cb0-24ea0d0f7990": true
      },
      {
        "text": "’s pronunciation and failure to itemize all the tasks set out in the job description."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[4] At the conclusion of the interview, the Officer advised Mr. "
      },
      {
        "text": "Brar",
        "accepted_a10a49a8-fc20-450f-b3d1-e7f413e75a28": true
      },
      {
        "text": " that she was concerned that he (i) did not meet the prospective job’s language requirement of spoken English; (ii) was unable to satisfactorily explain the duties that he would be expected to perform in Canada; (iii) had failed to demonstrate that he would be able to perform the work sought; and (iv) would not leave Canada at the end of his authorized stay. The Officer gave Mr. "
      },
      {
        "text": "Brar",
        "accepted_b2d30707-b462-4dc0-97d2-16086e991fff": true
      },
      {
        "text": " the opportunity to respond to these concerns. He responded: “I can speak … You can check my work.” The Officer then refused the application."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "II. Analysis\n[5] Mr. "
      },
      {
        "text": "Brar",
        "accepted_ca82386c-c8fb-410b-b0b2-d3dfe4397ad3": true
      },
      {
        "text": " argues that the Officer erred in concluding that he is unable to perform the work sought and would not leave Canada by the end of the period authorized for his stay under paragraphs 200(3)(a) and 200(1)(b) of the Immigration and Refugee Protection Regulations, SOR/2002-227 [Regulations]. Mr. "
      },
      {
        "text": "Brar",
        "accepted_4eac3587-1556-4a9a-818a-300a605ae66f": true
      },
      {
        "text": " also alleges that the Officer breached his right to procedural fairness."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[6] When reviewing the merits of an administrative decision, there is a presumption that the legislature intended the standard of review to be reasonableness (Canada (Minister of Citizenship and Immigration) v Vavilov, 2019 SCC 65 at para 23 [Vavilov]). This presumption may be rebutted where there is a clear indication of legislative intent or by the rule of law, neither of which is present in this case."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[7] The burden is on Mr. "
      },
      {
        "text": "Brar",
        "accepted_f9cf59fa-9d5b-4d60-b89a-b7767a3a769c": true
      },
      {
        "text": " to demonstrate unreasonableness (Vavilov at para 100). To determine whether a decision as a whole is reasonable, the reviewing court “asks whether the decision bears the hallmarks of reasonableness – justification, transparency and intelligibility – and whether it is justified in relation to the factual and legal constraints that bear on the decision” (Vavilov at para 99; Canada Post Corp v Canadian Union of Postal Workers, 2019 SCC 67 at para 32 [Canada Post]). To look at it from the other side of the coin, a decision will be unreasonable if the reasons, read in conjunction with the record, do not allow me to understand the Officer’s reasoning on a critical point (Vavilov at para 103)."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[8] As for issues of procedural fairness, Vavilov maintained the status quo (at paras 23 and 77). Procedural fairness is reviewed under the correctness standard, by considering whether the process was fair and just (Canadian Pacific Railway Company v Canada (Attorney General), 2018 FCA 69 at para 54; Mission Institution v Khela, 2014 SCC 24 at para 79). A. The Officer reasonably concluded that Mr. "
      },
      {
        "text": "Brar",
        "accepted_f306bfc4-07de-4f38-9f8d-13a6bf18e59c": true
      },
      {
        "text": " did not qualify for a work permit"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[9] Mr. "
      },
      {
        "text": "Brar",
        "accepted_942876d8-ecc5-463b-9fda-95b6740003b2": true
      },
      {
        "text": " submits that the Officer’s assessment of his oral English ability was flawed and that, in particular, the Officer did not identify the language level necessary for his job offer, and thus failed to comply with the relevant part of the Immigration, Refugees and Citizenship Canada [IRCC] “Temporary Workers” guidelines [Guidelines], at the webpage “Foreign workers: Assessing language requirements,” which states: An applicant’s language ability can be assessed through an interview or official testing such as IELTS/TEF or in-house mission testing practice. In deciding to require proof of language ability, the officer’s notes should refer to the LMIA requirements, working conditions as described in the job offer and NOC requirements for the specific occupation, in determining what precise level of language requirement is necessary to perform the work sought. System notes must clearly indicate the officer’s language assessment, and in the case of a refusal, clearly show a detailed analysis on how the applicant failed to satisfy the officer that they would be able to perform the work sought."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[10] I do not agree with this submission. While the Officer does not need to be constrained – or fettered – by the Guidelines, and is primarily governed by the legislative requirements as set out in the Immigration and Refugee Protection Act, SC 2001, c 27 and Regulations, the Officer’s Decision was nonetheless consistent with the points raised in these Guidelines: the Decision referenced the International English Second Language Testing System [IELTS] results, assessed Mr. "
      },
      {
        "text": "Brar",
        "accepted_58bf5111-5666-41f4-a0f5-b2e43a4a8dac": true
      },
      {
        "text": "’s language ability over the course of the interview, referred to the Labour Market Impact Assessment [LMIA] requirements and work requirements, and considered his English proficiency in the context of the work to be done. In fact, in the decision to interview Mr. "
      },
      {
        "text": "Brar",
        "accepted_d18dc58b-1ee5-4e2f-aaf1-5eb7fbf238d8": true
      },
      {
        "text": ", the Officer noted “PA to be interviewed to assess his stated work experience and english [sic] abilities to be able to read safety instructions as PA’s job involves a high risk to safety.” The GCMS notes, as summarized above in paragraph 2 of these Reasons, provide a detailed indication of areas where the language fell short. The Officer concluded, based on these findings, that Mr. "
      },
      {
        "text": "Brar",
        "accepted_157388e3-e431-40da-aaa8-b6ac3e7c8620": true
      },
      {
        "text": " would not be able to adequately perform the work sought."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[11] Mr. "
      },
      {
        "text": "Brar",
        "accepted_2b25f20f-2b1c-4f91-bd02-dd5ab25d8a9d": true
      },
      {
        "text": " further argues that the only job duty concerning language ability pertains to the interpretation of "
      },
      {
        "text": "welding",
        "accepted_dc997f95-1581-4343-920a-2e5969cc6f60": true
      },
      {
        "text": " process specifications, which engages his reading, not verbal, proficiency. I do not agree that the only relevant language skill required was his ability to read English. First, the LMIA provides that both written and verbal English were required for this particular employment. The Officer’s reference to “verbal English” reflects that the assessment was conducted with this requirement in mind."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[12] Furthermore, the job offer states that the job duties “include” interpreting "
      },
      {
        "text": "welding process specifications",
        "accepted_fc28ac7a-3de5-4418-8bf6-6f877e79c6d5": true
      },
      {
        "text": " and operating various equipment, amongst several other tasks. This language suggests that the offer does not provide an exhaustive list of job duties. While the other job requirements listed tend to be more operational in nature (i.e. operating various machines and processes), they certainly do not rule out verbal English as a basic requirement."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[13] Ultimately, officers must make their own determinations of the abilities based on the evidence and, here, the Officer simply placed more weight on the real-time interview with Mr. "
      },
      {
        "text": "Brar",
        "accepted_6e9fd461-39cf-4bfe-a299-998e3c2f8ad6": true
      },
      {
        "text": " than test scores. An officer’s findings of language proficiency under paragraph 200(3)(a) are both factual and discretionary (Singh Grewal v Canada (Citizenship and Immigration), 2013 FC 627 at para 17 [Grewal]; Sulce v Canada (Citizenship and Immigration), 2015 FC 1132 at para 8 [Sulce]). As such, I find that the Officer’s determinations of language proficiency were reasonable in this case."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[14] Finally, Mr. "
      },
      {
        "text": "Brar",
        "accepted_4d71b052-203e-4300-8546-644339fde0fd": true
      },
      {
        "text": " argues that his IELTS scores should just suffice for a work permit because they satisfy the Canadian Language Benchmarks for the Federal Skilled Trades Program. While that may well be, determinations under the "
      },
      {
        "text": "Temporary Foreign Worker program",
        "accepted_521b7994-410c-46f6-80c2-94008817161e": true
      },
      {
        "text": " fall under a different regulatory regime than those for the "
      },
      {
        "text": "Federal Skilled Worker Class",
        "accepted_a2809a04-ebc8-4519-9c3d-a09438950d99": true,
        "accepted_d027ad4c-f436-42b4-a39c-fc984cfb23b9": true
      },
      {
        "text": " and accordingly entail different considerations (Grewal at para 16). Officers are thus entitled to consider a number of factors in reaching a conclusion on the language proficiency required by the job and demonstrated by the applicant. They should certainly take language testing into account, just as the Officer did here. However, where a basic lack of comprehension emerges, the legislation posits the discretion to make a final determination in the hands of the officer under paragraph 200(3)(a) of the Regulations."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[15] I do concede that there were two areas in which the Officer overreached in finding problems relating to language skills – that Mr. "
      },
      {
        "text": "Brar",
        "accepted_af8cc6c4-26e4-4e15-91aa-940b96285e75": true
      },
      {
        "text": " failed to list all of the duties listed in the job offer letter and that he misclassified his job interviewer as the "
      },
      {
        "text": "owner",
        "accepted_7c5ef352-3217-42b7-9245-b23d0208f272": true
      },
      {
        "text": " of the company rather than its "
      },
      {
        "text": "vice president",
        "accepted_a11467d4-f92d-4d11-b28b-c37b7f75a4dd": true
      },
      {
        "text": ". While I find that both of these concerns, in isolation, are microscopic in nature (i.e. Mr. "
      },
      {
        "text": "Brar",
        "accepted_e874ce32-b334-4d8a-934b-8cef08f107f6": true
      },
      {
        "text": " described several key tasks, and did not have to know the precise role of his interviewer), these two shortcomings do not render the Decision unreasonable overall."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[16] Rather, when read as a whole, the Decision is reasonable, particularly because the Officer based the decision on language skills, detailing non-responses and lack of comprehension. The Officer justified the decision, and transparently explained why Mr. "
      },
      {
        "text": "Brar",
        "accepted_d6675b0b-7395-4077-ae30-c636eef5dab8": true
      },
      {
        "text": " did not satisfy the requirements for the work permit. In sum, Mr. "
      },
      {
        "text": "Brar",
        "accepted_2435ecbe-4556-4597-8e6b-a421b94cdb3b": true
      },
      {
        "text": " has not satisfied his onus to demonstrate to the Court that the Decision was unreasonable. The reasons, while understandably concise given the context of a visa office decisions, allow me to clearly understand."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[17] In addition, Mr. "
      },
      {
        "text": "Brar",
        "accepted_1f6ce86f-9b72-451b-a7d5-9125a3b0ab48": true
      },
      {
        "text": " submits that the Officer unreasonably failed to provide any rationale to support the conclusion that he would not leave Canada by the end of the authorized period."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[18] The Officer’s conclusion bears some similarity to Singh v Canada (Citizenship and Immigration), 2015 FC 115 [Singh], in which this Court determined that such a finding on temporary intent was reasonable when viewed contextually: when one considers the fact that the Officer’s finding is that Mr. "
      },
      {
        "text": "Brar",
        "accepted_7b5d4f82-691d-4da6-9075-4c3ef3b48bfd": true
      },
      {
        "text": " would not be able to fulfil the job duties, it follows that he would not be able to fulfill the terms of his temporary residence status (see Singh at para 23). B. The Officer did not breach Mr. "
      },
      {
        "text": "Brar",
        "accepted_88270536-3566-42cd-83d2-c802cef7cdc6": true
      },
      {
        "text": "’s right to procedural fairness"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[19] Mr. "
      },
      {
        "text": "Brar",
        "accepted_89830c39-828c-457e-9397-1bde9686eae2": true
      },
      {
        "text": " attended the interview with an interpreter because the letter requesting he take part in the interview stated that applicants who do not speak fluent English or French must attend with an interpreter. He deposes that the Officer dissuaded him from using the interpreter by saying: “Don’t waste my time if you are unable to speak English,” and argues that by doing so, the Officer breached Mr. "
      },
      {
        "text": "Brar",
        "accepted_e33528b6-5812-4e12-a8e0-dbf8146261fe": true
      },
      {
        "text": "’s right to procedural fairness."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[20] For the reasons stated above, I cannot agree that discouraging Mr. "
      },
      {
        "text": "Brar",
        "accepted_565670ca-2ede-4af9-ab8a-402e61a4932c": true
      },
      {
        "text": " from using an interpreter constituted a breach of procedural fairness. Had the situation been different, such as an interview for refugee protection or humanitarian relief, there may well have been a breach."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[21] However, a primary purpose of the interview was to assess Mr. "
      },
      {
        "text": "Brar",
        "accepted_57da0e23-fd21-4a56-8c38-de3ef1a6f1f4": true
      },
      {
        "text": "’s ability to satisfy the requirements of his prospective work, which included English language skills."
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "[22] Furthermore, I note that the level of procedural fairness owed in the context of temporary work permit applications is low and generally does not require that temporary work permit applicants be granted an opportunity to address the visa officer’s concerns (Singh at para 25; Sulce at para 10). Indeed, there was no breach of procedural fairness found in either Singh or Sulce despite neither applicant having received an opportunity to address the visa officer’s concerns. Here, to Mr. "
      },
      {
        "text": "Brar",
        "accepted_301cfbca-8998-4b5b-aad2-9d4724d5c730": true
      },
      {
        "text": "’s benefit, the Officer did grant such an opportunity, and accordingly satisfied the procedural fairness requirements. \nIII. Conclusion\n[23] While the Decision had some imperfections, these shortcomings are not “sufficiently serious” to undermine the reasonability of the Decision as a whole (Vavilov at para 100 and Canada Post at para 33). The Decision provides sufficient justification to support the Officer’s finding regarding Mr. "
      },
      {
        "text": "Brar",
        "accepted_24047694-6734-4a10-9839-5f10ff8e9d7c": true
      },
      {
        "text": "’s limited English language skills. Throughout the interview, the Officer had to repeat questions and Mr. "
      },
      {
        "text": "Brar",
        "accepted_c7fa425a-c4f4-4094-9144-9ca06eb0170c": true
      },
      {
        "text": " clearly had difficulties responding. I find the conclusion to be reasonable. Nor do I find any breach of procedural fairness. For these reasons, I am dismissing this judicial review. JUDGMENT in IMM-3128-19 THIS COURT’S JUDGMENT is that: \n1. This application for judicial review is dismissed.\n2. No questions for certification were argued, and I agree none arise.\n3. There is no award as to costs. Alan S. Diner Judge"
      }
    ]
  },
  {
    "type": "paragraph",
    "children": [
      {
        "text": "FEDERAL COURT SOLICITORS OF RECORD DOCKET: IMM-3128-19\nSTYLE OF CAUSE: "
      },
      {
        "text": "SUKHPREET SINGH BRAR",
        "accepted_9de73b26-7de8-450b-bc30-22866f721cf3": true
      },
      {
        "text": " V THE MINISTER OF CITIZENSHIP AND IMMIGRATION\nPLACE OF HEARING: TORONTO, ONTARIO\nDATE OF HEARING: JANUARY 13, 2020\nJUDGMENT AND REASONS: DINER J.\nDATED: JANUARY 17, 2020\nAPPEARANCES: "
      },
      {
        "text": "Monique Ann Ashamalla",
        "accepted_05d5f35d-728b-4ab4-a971-daeac7f630e3": true
      },
      {
        "text": "\nFOR THE APPLICANT Melissa Mathieu\nFOR THE RESPONDENT SOLICITORS OF RECORD: Ashamalla LLP Barristers and Solicitors Toronto, Ontario\nFOR THE APPLICANT Attorney General of Canada Toronto, Ontario\nFOR THE RESPONDENT\n"
      }
    ]
  }
]
